In [32]:
from pandas import DataFrame, Series
import pandas as pd
import numpy as np

In [4]:
df2 = DataFrame([['1'], ['2'], ['3'], \
                ['4'], ['5'], ['6'], \
                ['7'], ['8'], ['9'], \
                ['10']], columns=['Col1'])

In [15]:
df2.astype(int).sort_values['Col1']

TypeError: 'instancemethod' object has no attribute '__getitem__'

In [ ]:
tz_counts[:10].plot(kin)

Wednesday practice

In [25]:
hp = DataFrame(data = [['Lordship Lane, London N17', 625000, '3 bed semi-detached house', '2017-01-19'], \
                       ['Sperling Road, London N17', 495000, '3 bed terraced house', '2017-01-18'], \
                       ['Rivulet Road, London N17', 450000, '3 bed semi-detached house', '2017-01-18'], \
                       ['Ruskin Road, London N17', 550000, '6 bed terraced house', '2017-01-17'], \
                       ['Handsworth Road, London N17', 339995, '2 bed flat', '2017-01-17']], \
                        columns = ['location', 'listprice', 'description', 'listdate'])

In [26]:
hp

,location,listprice,description,listdate
0,"Lordship Lane, London N17",625000,3 bed semi-detached house,2017-01-19
1,"Sperling Road, London N17",495000,3 bed terraced house,2017-01-18
2,"Rivulet Road, London N17",450000,3 bed semi-detached house,2017-01-18
3,"Ruskin Road, London N17",550000,6 bed terraced house,2017-01-17
4,"Handsworth Road, London N17",339995,2 bed flat,2017-01-17

In [27]:
hp.dtypes

location       object
listprice       int64
description    object
listdate       object
dtype: object

In [28]:
hp.listdate = hp.listdate.astype('datetime64[ns]', inplace=True)

In [29]:
  hp.dtypes

location               object
listprice               int64
description            object
listdate       datetime64[ns]
dtype: object

In [30]:
hp.listprice = hp.listprice.astype('float', inplace=True)

In [35]:
hp['som'] = pd.DatetimeIndex(np.array(hp.listdate, dtype='datetime64[M]'), freq=None) #  finding start of the month

In [36]:
hp

,location,listprice,description,listdate,som
0,"Lordship Lane, London N17",625000.0,3 bed semi-detached house,2017-01-19,2017-01-01
1,"Sperling Road, London N17",495000.0,3 bed terraced house,2017-01-18,2017-01-01
2,"Rivulet Road, London N17",450000.0,3 bed semi-detached house,2017-01-18,2017-01-01
3,"Ruskin Road, London N17",550000.0,6 bed terraced house,2017-01-17,2017-01-01
4,"Handsworth Road, London N17",339995.0,2 bed flat,2017-01-17,2017-01-01

In [37]:
hp.drop(2, 0, inplace=True)   # 0 means row therefore you are dropping row 2, if wanted to drop column then: (2,1)

In [38]:
hp

,location,listprice,description,listdate,som
0,"Lordship Lane, London N17",625000.0,3 bed semi-detached house,2017-01-19,2017-01-01
1,"Sperling Road, London N17",495000.0,3 bed terraced house,2017-01-18,2017-01-01
3,"Ruskin Road, London N17",550000.0,6 bed terraced house,2017-01-17,2017-01-01
4,"Handsworth Road, London N17",339995.0,2 bed flat,2017-01-17,2017-01-01

In [39]:
hp['eom'] = pd.DatetimeIndex(np.array(hp.listdate, dtype='datetime64[D]'), freq=None) \ #  finding end of the month 
+ pd.tseries.offsets.MonthEnd(1)

In [40]:
hp

,location,listprice,description,listdate,som,eom
0,"Lordship Lane, London N17",625000.0,3 bed semi-detached house,2017-01-19,2017-01-01,2017-01-31
1,"Sperling Road, London N17",495000.0,3 bed terraced house,2017-01-18,2017-01-01,2017-01-31
3,"Ruskin Road, London N17",550000.0,6 bed terraced house,2017-01-17,2017-01-01,2017-01-31
4,"Handsworth Road, London N17",339995.0,2 bed flat,2017-01-17,2017-01-01,2017-01-31

In [44]:
def pricebucket(b):
    if b['listprice'] <= 350000:
        return 'bargain'
    elif b['listprice'] <= 500000:
        return 'market rate'
    elif b['listprice'] <=600000:
        return 'a little overpriced'
    elif b['listprice'] > 600000:
        return 'avoid'

In [47]:
hp['pricedescription'] = hp.apply(lambda x: pricebucket(x), axis=1) #  to apply the price bucket created to all the rows in columns (as listprice is a column)

In [48]:
hp

,location,listprice,description,listdate,som,eom,pricedescription
0,"Lordship Lane, London N17",625000.0,3 bed semi-detached house,2017-01-19,2017-01-01,2017-01-31,avoid
1,"Sperling Road, London N17",495000.0,3 bed terraced house,2017-01-18,2017-01-01,2017-01-31,market rate
3,"Ruskin Road, London N17",550000.0,6 bed terraced house,2017-01-17,2017-01-01,2017-01-31,a little overpriced
4,"Handsworth Road, London N17",339995.0,2 bed flat,2017-01-17,2017-01-01,2017-01-31,bargain

In [56]:
k = DataFrame(data=[['Lawrence', 38, 'M'],['Rory', 24, 'M'],['Jordan', 24, 'M'],['Izzy', 23, 'F'],['Rachel', 24, 'F']], columns=['Name', 'Age', 'Gender'])

In [57]:
k

       Name  Age Gender
0  Lawrence   38      M
1      Rory   24      M
2    Jordan   24      M
3      Izzy   23      F
4    Rachel   24      F

In [58]:
for r in k.groupby('Gender'):
    print r

('F',      Name  Age Gender
3    Izzy   23      F
4  Rachel   24      F)
('M',        Name  Age Gender
0  Lawrence   38      M
1      Rory   24      M
2    Jordan   24      M)

In [66]:
k.groupby('Gender').agg(lambda row: (', '.join(row.Name), int(row.Age.mean())))

                          Name  Age
Gender
F                 Izzy, Rachel   23
M       Lawrence, Rory, Jordan   28